public class VarDemo {
    // var field = 10; // Не компилируется — var нельзя использовать для полей класса

    public static void main(String[] args) {
     //   int, String, ArrayList, array

               var num =Integer.valueOf(5);
        System.out.println("num var:"+num.getClass().getName());



        // Напишите 5 рабочих примеров с var
        // Для каждого выведите тип через getClass().getSimpleName()

        // Затем в комментариях покажите 4 случая, где var не работает
    }
}
